In [2]:
import pandas as pd

In [5]:
!pwd

/home/gomi/dev_ws/EDA

In [6]:
!ls

CCTV.ipynb  data  Hello.ipynb  Hello.py

In [18]:
cctv_seoul = pd.read_csv('./data/01. Seoul_CCTV.csv')
cctv_seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [32]:
cctv_seoul.rename(columns={cctv_seoul.columns[0]:'구별'}, inplace=True)
cctv_seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [40]:
pop_seoul = pd.read_excel('./data/01. Seoul_Population.xls',
                         header=2, usecols='B, D, G, J, N')
pop_seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10124579  9857426  267153   1365126
1  종로구    164257   154770    9487     26182
2   중구    134593   125709    8884     21384
3  용산구    244444   229161   15283     36882
4  성동구    312711   304808    7903     41273

In [44]:
# 인구수 한국인 외국인 고령자
pop_seoul.rename(columns={pop_seoul.columns[0]:'구별',
                          pop_seoul.columns[1]:'인구수',
                          pop_seoul.columns[2]:'한국인',
                          pop_seoul.columns[3]:'외국인',
                          pop_seoul.columns[4]:'고령자' },
                inplace=True)
pop_seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10124579  9857426  267153  1365126
1  종로구    164257   154770    9487    26182
2   중구    134593   125709    8884    21384
3  용산구    244444   229161   15283    36882
4  성동구    312711   304808    7903    41273

# Pandas

In [45]:
import numpy as np
import pandas as pd

In [56]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [61]:
np.random.randn(6,4)

array([[ 1.76237714e+00,  4.62387267e-01,  1.15665061e-03,
        -6.38585636e-01],
       [-2.13806229e+00,  1.83287456e+00, -5.84400218e-02,
         5.23875179e-01],
       [-5.92314692e-01, -1.29931289e+00, -1.36941284e+00,
        -1.18646070e+00],
       [-7.54603569e-01, -2.14905500e-01, -1.46040721e-01,
         7.80730375e-01],
       [-8.63162620e-01, -1.53274163e+00,  5.71286356e-01,
         2.34726184e-01],
       [ 3.76956414e-03, -9.24608263e-01, -2.36599303e+00,
         5.19842388e-03]])

In [65]:
date_list = pd.date_range('20130101', periods=6)
date_list

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [67]:
df = pd.DataFrame(np.random.randn(6,4),
                  index=date_list,
                  columns=['A','B','C', 'D'])
df

                   A         B         C         D
2013-01-01  1.667341  0.303925  1.597229  0.964281
2013-01-02 -0.593590 -0.594896  0.864947  0.337001
2013-01-03 -0.838799 -0.333752  0.596328 -0.415046
2013-01-04  0.994095  2.270421  1.430901  1.088551
2013-01-05 -0.181887  0.940349  0.474817 -0.237058
2013-01-06  1.009814 -1.519376 -0.114378 -0.605579

In [69]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [70]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [71]:
df.values

array([[ 1.66734095,  0.30392542,  1.597229  ,  0.96428076],
       [-0.59359046, -0.59489649,  0.86494692,  0.33700089],
       [-0.83879942, -0.3337516 ,  0.59632832, -0.41504591],
       [ 0.99409451,  2.27042057,  1.43090112,  1.08855143],
       [-0.18188721,  0.94034892,  0.47481664, -0.23705756],
       [ 1.00981404, -1.51937629, -0.11437773, -0.60557944]])

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [73]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.342829  0.177778  0.808307  0.188692
std    1.017035  1.320273  0.635724  0.722483
min   -0.838799 -1.519376 -0.114378 -0.605579
25%   -0.490665 -0.529610  0.505195 -0.370549
50%    0.406104 -0.014913  0.730638  0.049972
75%    1.005884  0.781243  1.289413  0.807461
max    1.667341  2.270421  1.597229  1.088551

In [75]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-04  0.994095  2.270421  1.430901  1.088551
2013-01-05 -0.181887  0.940349  0.474817 -0.237058
2013-01-01  1.667341  0.303925  1.597229  0.964281
2013-01-03 -0.838799 -0.333752  0.596328 -0.415046
2013-01-02 -0.593590 -0.594896  0.864947  0.337001
2013-01-06  1.009814 -1.519376 -0.114378 -0.605579

In [76]:
df['A']

2013-01-01    1.667341
2013-01-02   -0.593590
2013-01-03   -0.838799
2013-01-04    0.994095
2013-01-05   -0.181887
2013-01-06    1.009814
Freq: D, Name: A, dtype: float64

In [77]:
df[1:4]

                   A         B         C         D
2013-01-02 -0.593590 -0.594896  0.864947  0.337001
2013-01-03 -0.838799 -0.333752  0.596328 -0.415046
2013-01-04  0.994095  2.270421  1.430901  1.088551

In [78]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.593590 -0.594896  0.864947  0.337001
2013-01-03 -0.838799 -0.333752  0.596328 -0.415046
2013-01-04  0.994095  2.270421  1.430901  1.088551

In [80]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -0.593590 -0.594896
2013-01-03 -0.838799 -0.333752
2013-01-04  0.994095  2.270421

In [81]:
df.iloc[1:4, 2:4]

                   C         D
2013-01-02  0.864947  0.337001
2013-01-03  0.596328 -0.415046
2013-01-04  1.430901  1.088551

In [87]:
df['A']>0

2013-01-01     True
2013-01-02    False
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06     True
Freq: D, Name: A, dtype: bool

In [86]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  1.667341  0.303925  1.597229  0.964281
2013-01-04  0.994095  2.270421  1.430901  1.088551
2013-01-06  1.009814 -1.519376 -0.114378 -0.605579

In [85]:
df>0

                A      B      C      D
2013-01-01   True   True   True   True
2013-01-02  False  False   True   True
2013-01-03  False  False   True  False
2013-01-04   True   True   True   True
2013-01-05  False   True   True  False
2013-01-06   True  False  False  False

In [88]:
df[df>0]

                   A         B         C         D
2013-01-01  1.667341  0.303925  1.597229  0.964281
2013-01-02       NaN       NaN  0.864947  0.337001
2013-01-03       NaN       NaN  0.596328       NaN
2013-01-04  0.994095  2.270421  1.430901  1.088551
2013-01-05       NaN  0.940349  0.474817       NaN
2013-01-06  1.009814       NaN       NaN       NaN

In [103]:
df

                   A         B         C         D
2013-01-01  1.667341  0.303925  1.597229  0.964281
2013-01-02 -0.593590 -0.594896  0.864947  0.337001
2013-01-03 -0.838799 -0.333752  0.596328 -0.415046
2013-01-04  0.994095  2.270421  1.430901  1.088551
2013-01-05 -0.181887  0.940349  0.474817 -0.237058
2013-01-06  1.009814 -1.519376 -0.114378 -0.605579

In [104]:
df['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df

                   A         B         C         D      E
2013-01-01  1.667341  0.303925  1.597229  0.964281    one
2013-01-02 -0.593590 -0.594896  0.864947  0.337001    one
2013-01-03 -0.838799 -0.333752  0.596328 -0.415046    two
2013-01-04  0.994095  2.270421  1.430901  1.088551  three
2013-01-05 -0.181887  0.940349  0.474817 -0.237058   four
2013-01-06  1.009814 -1.519376 -0.114378 -0.605579  three

In [105]:
df['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [106]:
df[df['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.838799 -0.333752  0.596328 -0.415046   two
2013-01-05 -0.181887  0.940349  0.474817 -0.237058  four

In [107]:
del df['E']

In [108]:
df

                   A         B         C         D
2013-01-01  1.667341  0.303925  1.597229  0.964281
2013-01-02 -0.593590 -0.594896  0.864947  0.337001
2013-01-03 -0.838799 -0.333752  0.596328 -0.415046
2013-01-04  0.994095  2.270421  1.430901  1.088551
2013-01-05 -0.181887  0.940349  0.474817 -0.237058
2013-01-06  1.009814 -1.519376 -0.114378 -0.605579

In [111]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  1.667341  0.303925  1.597229  0.964281
2013-01-02  1.073750 -0.290971  2.462176  1.301282
2013-01-03  0.234951 -0.624723  3.058504  0.886236
2013-01-04  1.229046  1.645698  4.489405  1.974787
2013-01-05  1.047158  2.586047  4.964222  1.737730
2013-01-06  2.056972  1.066671  4.849844  1.132150